app/Traits/ProductManager.php

    public function products($sellerId = 0, $isTrashed = false)
    {
        $search = trim(strtolower(request()->search));
        $query  = Product::query();
        if($sellerId)
        $query  = $query->sellers();
        $query  = $query->with(['categories','brand', 'stocks'])->whereHas('categories')->whereHas('brand');
        if($isTrashed)
        $query  = $query->onlyTrashed();
        if($search)
        $query  = $query->where('name', 'like', "%$search%");

        $data['products']       = $query->orderByDesc('id')->paginate(getPaginate());
---
select * from `brands` where `brands`.`id` in (1) and `brands`.`deleted_at` is null
select `categories`.*, `products_categories`.`product_id` as `pivot_product_id`, `products_categories`.`category_id` as `pivot_category_id` from `categories` inner join `products_categories` on `categories`.`id` = `products_categories`.`category_id` where `products_categories`.`product_id` in (1, 3) and `categories`.`deleted_at` is null

    public function productByVendor($admin = true, $isTrashed = false)
    {
        $search = trim(strtolower(request()->search));

        $query  = Product::query();
        if($isTrashed)
        $query  = $query->onlyTrashed();
        if($search)
        $query  = $query->where('name', 'like', "%$search%");
        if($admin){
            $data['pageTitle']      = 'Products By Admin';
            $query = $query->where('seller_id',0);
        }else{
            $data['pageTitle']      = 'Products By Seller';
            $query = $query->where('seller_id','!=',0);
        }

        $data['products']       = $query->orderByDesc('id')->paginate(getPaginate());
---
select * from `products` where `seller_id` = 0 and `products`.`deleted_at` is null order by `id` desc limit 20 offset 0
select count(*) as aggregate from `products` where `seller_id` = 0 and `products`.`deleted_at` is null

    public function productCreate()
    {
        $data['categories'] = Category::with('allSubcategories')->where('parent_id', null)->get();
        $data['brands']     = Brand::orderBy('name')->get();
---
select * from `categories` where `parent_id` is null and `categories`.`deleted_at` is null
select * from `brands` where `brands`.`deleted_at` is null order by `name` asc

    public function editProduct($id, $sellerId =0)
    {
        if($sellerId)
        $data['product']        = Product::where('seller_id', $sellerId)->where('id', $id)->firstOrFail();
        else
        $data['product']        = Product::whereId($id)->first();

        $data['categories']     = Category::with('allSubcategories')->where('parent_id', null)->get();
        $data['brands']         = Brand::orderBy('name')->get();
---
select * from `products` where `id` = '1' and `products`.`deleted_at` is null limit 1
select * from `categories` where `parent_id` is null and `categories`.`deleted_at` is null
select * from `brands` where `brands`.`deleted_at` is null order by `name` asc

        $product->meta_title        = $request->meta_title;
        $product->meta_description  = $request->meta_description;
        $product->meta_keywords     = $request->meta_keywords??null;
        $product->save();
---
insert into `products` (`status`, `seller_id`, `brand_id`, `sku`, `name`, `model`, `has_variants`, `track_inventory`, `show_in_frontend`, `main_image`, `video_link`, `description`, `summary`, `specification`, `extra_descriptions`, `base_price`, `meta_title`, `meta_description`, `meta_keywords`, `updated_at`, `created_at`) values (1, 0, '1', 'Animi accusamus inc', 'Zeus Chang', 'Reprehenderit dolore', 0, '1', 0, '644937013dda71682519809.png', 'Consectetur qui exer', 'SDAS', 'Aut et quo illum fu', '', '', '539', 'Aut modi non nihil t', 'Beatae ipsum asperio', '[\"Reprehenderit\"]', '2023-04-26 20:06:49', '2023-04-26 20:06:49')

    protected function checkSKU($sku, $id)
    {
        Product::where('sku', $sku)->where('id', '!=', $id)->with('stocks')->orWhereHas('stocks', function($q)use($sku, $id){
            $q->where('sku', $sku)->where('product_id', '!=', $id);
        })->first();
---
select * from `products` where (`sku` = 'Animi accusamus inc' and `id` != '0' or exists (select * from `product_stocks` where `products`.`id` = `product_stocks`.`product_id` and `sku` = 'Animi accusamus inc' and `product_id` != '0')) and `products`.`deleted_at` is null limit 1