app/Http/Controllers/Admin/AdminController.php

select * from `orders` where `payment_status` != 0 order by `created_at` desc limit 6
---
    public function dashboard()
    {
        //customers Count
        $customers = getCustomers()->customers;
         //products Count
         $products = getProducts()->products;
        //customers Orders
        $orders = getOrders()->orders;
        $totalSellAmount = 0;
        foreach ($orders as $order) {
            $totalSellAmount += $order->total_price;
        }
        // dd($totalSellAmount);
        $pageTitle = 'Order Details';

        $pageTitle = 'All Shop\'s Analytics';
        // User Info
        $widget['total_users']              =        count($customers);  // User::count();

        $widget['verified_users']           =        count($customers);  // User::where('status', 1)->count();

        $widget['all_orders']               =        count($orders);    // Order::where('payment_status', '!=', 0)->count();

        $widget['delivered_orders']         =        count($orders);  //Order::where('payment_status', '!=', 0)->where('status',3)->count();

        $recent_orders                      =        Order::where('payment_status', '!=', 0)->latest()->take(6)->get();

select count(*) as aggregate from `sellers` where `status` = 1
---

        $widget['total_seller']             = Seller::count();

        $widget['total_active_seller']      = Seller::where('status',1)->count();

select SUM( CASE WHEN status = 1 THEN amount END) as depositAmount, DATE_FORMAT(created_at,'%M-%Y') as months from `deposits` where `created_at` >= '2022-04-26 18:20:32' and `status` = 1 group by `months` order by `created_at` asc
---
        $report['withdraw_month_amount'] = collect([]);


        $depositsMonth = Deposit::where('created_at', '>=', Carbon::now()->subYear())
            ->where('status', 1)
            ->selectRaw("SUM( CASE WHEN status = 1 THEN amount END) as depositAmount")
            ->selectRaw("DATE_FORMAT(created_at,'%M-%Y') as months")
            ->orderBy('created_at')
            ->groupBy('months')->get();

select SUM( CASE WHEN status = 1 THEN amount END) as withdrawAmount, DATE_FORMAT(created_at,'%M-%Y') as months from `withdrawals` where `created_at` >= '2022-04-26 18:20:32' and `status` = 1 group by `months` order by `created_at` asc
---
            $report['deposit_month_amount']->push(showAmount($depositData->depositAmount));
        });

        $withdrawalMonth = Withdrawal::where('created_at', '>=', Carbon::now()->subYear())->where('status', 1)
            ->selectRaw("SUM( CASE WHEN status = 1 THEN amount END) as withdrawAmount")
            ->selectRaw("DATE_FORMAT(created_at,'%M-%Y') as months")
            ->orderBy('created_at')
            ->groupBy('months')->get();

select sum(amount) as totalAmount, DATE(created_at) day from `withdrawals` where `created_at` >= '2023-03-27 18:20:32' and `status` = 1 group by `day`
---
        }

        // Withdraw Graph
        $withdrawal = Withdrawal::where('created_at', '>=', \Carbon\Carbon::now()->subDays(30))->where('status', 1)
            ->selectRaw('sum(amount) as totalAmount')
            ->selectRaw('DATE(created_at) day')
            ->groupBy('day')->get();

select sum(amount) as totalAmount, DATE(created_at) day from `deposits` where `created_at` >= '2023-03-27 18:20:32' and `status` = 1 group by `day`
---


        // Deposit Graph
        $deposit = Deposit::where('created_at', '>=', \Carbon\Carbon::now()->subDays(30))->where('status', 1)
            ->selectRaw('sum(amount) as totalAmount')
            ->selectRaw('DATE(created_at) day')
            ->groupBy('day')->get();

select `browser`, `os`, `country` from `user_logins` where `created_at` >= '2023-03-27 18:20:32'
---


        // user Browsing, Country, Operating Log
        $userLoginData = UserLogin::where('created_at', '>=', \Carbon\Carbon::now()->subDay(30))->get(['browser', 'os', 'country']);

select count(*) as aggregate from `deposits` where `status` = 2
select sum(`amount`) as aggregate from `withdrawals` where `status` = 1
select sum(`charge`) as aggregate from `withdrawals` where `status` = 1
select count(*) as aggregate from `withdrawals` where `status` = 2
---

        $payment['total_deposit_amount'] =  $totalSellAmount; //Deposit::where('status',1)->sum('amount');
        $payment['total_deposit_charge'] =  $totalSellAmount; // Deposit::where('status',1)->sum('charge');
        $payment['total_deposit_pending'] = Deposit::where('status',2)->count();

        $paymentWithdraw['total_withdraw_amount'] = Withdrawal::where('status',1)->sum('amount');
        $paymentWithdraw['total_withdraw_charge'] = Withdrawal::where('status',1)->sum('charge');
        $paymentWithdraw['total_withdraw_pending'] = Withdrawal::where('status',2)->count();