app/Http/Controllers/Admin/ProductController.php

select * from `product_images` where `product_images`.`product_id` in (3)
select * from `products` where `id` = '3' and `products`.`deleted_at` is null limit 1
---
    public function import($id)
    {
      $specificProduct =  Product::with('productImages')->where('id',$id)->first();

select * from `product_images` where `product_images`.`product_id` in (1, 2, 3, 4, 8)
select * from `products` where `products`.`deleted_at` is null
---
    public function bulkImport()
    {
         $allProducts =  Product::with('productImages')->get();

update `products` set `is_featured` = 1, `products`.`updated_at` = '2023-05-01 17:16:06' where `id` = 8
---
    public function featured(Request $request)
    {
        $request->validate([
            'product_id'    =>'required|integer|gt:0',
        ]);

        $product = Product::findOrFail($request->product_id);

        if($product->is_featured == 1){
            $product->is_featured = 0;
            $msg = "Product removed from featured";
        } else{
            $product->is_featured = 1;
            $msg = "Product marked as featured";
        }

        $product->save();